data/scalar_verification/ad_1d_Pe1000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet_drug
    {
        type            patch;
        nFaces          1;
        startFace       499;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       500;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       501;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1000;
        startFace       1501;
    }
)

// ************************************************************************* //
